{
    "taurus": "There’s no place like home—especially yours—today as the Sun and gregarious Mercury sync up in your domesticity realm. If you work for yourself or have a job with flexible arrangements, see if you can work from your abode (or patio or pool?) most of the day. You’ll feel more grounded and, as a result, get better work done. Pause to pick up some fresh veggies and cheese, then maybe invite a friend or three to drop in for apps and wine at Chez Taurus after you finish your duties. Warning: This could become habit-forming.",
    "aries": "It may be hard to focus on work today, raising the question: must you? With the Sun and curious Mercury united in your playful fifth house, the challenge may be squeezing in all the fun things you’d love to get up to. What with summer sales, the beach calling and the prospect of a long hike or bike ride far from the crowds, you could fill a week. And if a certain someone hasn’t been getting enough of your time, make sure to include them in your plans.",
    "gemini": "Ready, set, goals! You may rise and shine with your head full of inspiring ideas today as the creative Sun and innovative Mercury team up in your house of work and money. This isn’t mere brainstorming, Crab. The notions that are rocking your cranium could have serious money-making potential. Get everything down on paper or in a recording so you can pore over it in detail later. With social Mercury in the mix, you might think of the perfect person to complete the puzzle.",
    "cancer": "Ready, set, goals! You may rise and shine with your head full of inspiring ideas today as the creative Sun and innovative Mercury team up in your house of work and money. This isn’t mere brainstorming, Crab. The notions that are rocking your cranium could have serious money-making potential. Get everything down on paper or in a recording so you can pore over it in detail later. With social Mercury in the mix, you might think of the perfect person to complete the puzzle.",
    "leo": "Lean in more to your diplomatic side than your dramatically persuasive one today, Leo. (The latter will come more naturally, which is why you’ll need to make an effort to be tactful.) With your ruler, the effervescent Sun, aligned with quick-witted Mercury in your sign, words will come pouring out of you—but they might not all be appropriate for every situation. You don’t have to water down your talking points or your principles. Just make sure you don’t offend and thus lose your audience before you hook ‘em!",
    "virgo": "Trust your gut more than the so-called experts and their data today, Virgo. With the enlightening Sun linked up with messenger Mercury in your twelfth house of divine downloads, those “random” intuitive hits are worth taking seriously. At the very least think of them as potential guideposts or red flags. Listen to people’s offers and pitches but stay noncommittal and follow your own research process later (meditating, journaling, pulling an angel card…). Feed your creativity by taking in an art show or maybe a kirtan session after yoga class.",
    "libra": "People are your not-so-secret weapon today as the outgoing Sun links up with socially savvy Mercury in your communal eleventh house. You know your friends are your greatest (and favorite) asset, but under this expansive alignment, your social parameters could expand even further! Don’t underestimate the power of your virtual connections. Whatever you’re pitching, promoting or recruiting for, post it and tag specific friends. You could find the perfect person or situation—and, bonus for single Libras, a potential love match!",
    "scorpio": "Work that practical magic today, Scorpio! The creative Sun mashes up with mentally nimble Mercury in your tenth house of work, success and goals, helping you accomplish a major to-do-list item—in a manner than might grab the attention of a decision maker. But with these high beams in your career house, it’s not enough to tick tasks off a list. What are your highest objectives for the rest of the summer? Pick one or two, determine the necessary first steps, and then, before the day is through, tackle at least one!",
    "sagittarius": "You’re all about expansion and diversity, so today’s meetup of the radiant Sun and gregarious Mercury in your worldly ninth house could rocket you to influencer status. You can never hide your passion, Sagittarius, so why not use it for your own (magnanimous) growth? You know that you’ll immediately share any bounty with your crew, so go ahead and be a little “selfish”: Your rising tide will raise MANY boats!",
    "capricorn": "Whether you’re single or attached, deep soulful bonding is what you’re jonesing for today. A once-a-year hookup of the fiery Sun and seductive Mercury in your eighth house of sex and merging could give you all kinds of interesting ideas for behind-closed-doors activities. Conversations could run deep, too, so let yourself get a little vulnerable with a trusted friend or someone who seems like a kindred spirit. Financially, this is a great day to explore a joint business venture or investment opportunity.",
    "aquarius": "Today’s once-a-year meetup of the candid Sun and messenger Mercury in your relationship realm can help you broach a subject you may have been avoiding like the plague. Since anticipation is generally worse than the thing itself, the longer you put this off, the more intimidating it’s going to seem. Cough up the courage and find a gentle way in. But don’t hog the talking stick. Say your piece then let the other person respond—without interrupting. The relief you’ll feel when it’s over will be immeasurable.",
    "pisces": "Healthy doesn’t have to be painful, Pisces, as today’s playful pairing of the fun-loving Sun and social Mercury in your fitness zone will remind you. You don’t have to start training for a half-marathon or do advanced power yoga to get your wellness on. What does YOUR body enjoy: swimming, walking in nature, Nia? With Mercury in the mix, you may enjoy a lively class more than a solo workout. Afterward, see who’s up for a group dinner: shared veg tapas anyone?"
}
